# InvalidElementPropToGlobalParamLink Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GlobalParameterFailures..::..InvalidElementPropToGlobalParamLink Property
BuiltInFailures..::..GlobalParameterFailures Class See Also
---
The following parameters of the highlighted element can no longer be linked to global parameters: %1!s!.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidElementPropToGlobalParamLink { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidElementPropToGlobalParamLink As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidElementPropToGlobalParamLink {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GlobalParameterFailures Class
Autodesk.Revit.DB Namespace